---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectHostDeleted
source: html/33dfa251-7e48-e835-ec71-5be4bfdf1860.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectHostDeleted Property

Some pinned objects were deleted because their parent or host object was deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId PinnedObjectHostDeleted { get; }
```